#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Tue Jun  8 00:14:08 2021

@author: liangdongkai
"""

fuchejia = {
              "轮胎_胎面辐射声（轮胎选型）":[[0, ], [1]],
              "轮胎_力传递峰值频率":[[0, ], [1]],
              "轮胎_力传递峰值":[[0, ], [1]],
              "轮胎_操稳性能":[[0, ], [1]],
              "轮胎_耐久性能":[[0, ], [1]],
              "轮辋刚度_16-17’":[[0, ], [1]],
              "轮辋刚度_18-19’":[[0, ], [1]],
              "前副车架（自由-自由）_全副车架(bend)模态":[[0, ], [1]],
              "前副车架（自由-自由）_半副车架(bend)模态":[[0, ], [1]],
              "后副车架（自由-自由）_类型一：扭转梁(bend)模态":[[0, ], [1]],
              "后副车架（自由-自由）_类型二：多连杆(横梁弯曲)模态":[[0, ], [1]]}
xiabaibi = {
            "前下摆臂handling衬套_X向静刚度":[[0, ], [1]],
            "前下摆臂handling衬套_Y向静刚度":[[0, ], [1]],
            "前下摆臂handling衬套_Z向静刚度":[[0, ], [1]],
            "前下摆臂handling衬套_操稳性能":[[0, ], [1]],
            "前下摆臂handling衬套_耐久性能":[[0, ], [1]],
            "前下摆臂ride衬套_X向静刚度":[[0, ], [1]],
            "前下摆臂ride衬套_Y向静刚度":[[0, ], [1]],
            "前下摆臂ride衬套_Z向静刚度":[[0, ], [1]],
            "前下摆臂ride衬套_操稳性能":[[0, ], [1]],
            "前下摆臂ride衬套_耐久性能":[[0, ], [1]],
            "后副车架前衬套_X向静刚度":[[0, ], [1]],
            "后副车架前衬套_Y向静刚度":[[0, ], [1]],
            "后副车架前衬套_Z向静刚度":[[0, ], [1]],
            "后副车架前衬套_操稳性能":[[0, ], [1]],
            "后副车架前衬套_耐久性能":[[0, ], [1]],
            "后副车架后衬套_X向静刚度":[[0, ], [1]],
            "后副车架后衬套_Y向静刚度":[[0, ], [1]],
            "后副车架后衬套_Z向静刚度":[[0, ], [1]],
            "后副车架后衬套_操稳性能":[[0, ], [1]],
            "后副车架后衬套_耐久性能":[[0, ], [1]],
            "刀锋臂衬套_X向静刚度":[[0, ], [1]],
            "刀锋臂衬套_Y向静刚度":[[0, ], [1]],
            "刀锋臂衬套_Z向静刚度":[[0, ], [1]],
            "刀锋臂衬套_操稳性能":[[0, ], [1]],
            "刀锋臂衬套_耐久性能":[[0, ], [1]]
        }
cheshen = {
            "白车身_全局扭转模态频率":[[0, ], [1]],
            "白车身_	全局弯曲模态频率":[[0, ], [1]],
            "C ring_Visual Check":[[0, ], [1]],
            "前围_大板刚度":[[0, ], [1]],
            "一号梁_Visual Check":[[0, ], [1]],
            "地板_大板刚度":[[0, ], [1]],
            "地板无支撑板面积_	Visual Check":[[0, ], [1]],
            "备胎舱地板_大板刚度":[[0, ], [1]],
            "备胎舱加强板设计_Visual Check":[[0, ], [1]],
            "顶棚_大板刚度":[[0, ], [1]],
            "顶棚结构_Visual Check":[[0, ], [1]],
            "左轮罩内板_大板刚度":[[0, ], [1]],
            "后减震器加强板_Visual Check":[[0, ], [1]],
            "右轮罩内板_大板刚度":[[0, ], [1]],
            "后侧围外板_大板刚度":[[0, ], [1]],
            "衣帽架_大板刚度":[[0, ], [1]],
            "落水槽_大板刚度":[[0, ], [1]],
            "落水槽支架设计_Visual Check":[[0, ], [1]]
         }




